Formações/Ruby/4-Conhecendo Ruby on Rails/3-Criando o seu Blog com Ruby on Rails/blog-de-livros/app/controllers/livros_controller.rb

  def index
    @livros = Livro.all
---
SELECT "livros".* FROM "livros"

    def set_livro
      @livro = Livro.find(params[:id])
---
SELECT "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]